In [1]:
import pandas as pd
import numpy as np
from datetime import datetime

## 1. Create a DataFrame from a dictionary containing 3 columns: "name", "age", "city".

In [2]:
df = pd.DataFrame({
    'Name':['ALice','Bob','Charlie'],
    'Age':[23,25,24],
    'City':['New York', 'Texas', 'Ohio']
})

In [3]:
df

      Name  Age      City
0    ALice   23  New York
1      Bob   25     Texas
2  Charlie   24      Ohio

## 2. Load a CSV file named "students.csv" and show:
- First 5 rows
- Last 3 rows
- Shape

In [4]:
%%writefile student.csv
StudentID,FirstName,LastName,Age,Major,GPA,EnrollmentDate,IsActive
1001,Emily,Johnson,19,Computer Science,3.8,2023-09-01,True
1002,Michael,Brown,20,Electrical Engineering,3.5,2022-09-01,True
1003,Sarah,Davis,21,Mathematics,3.9,2021-09-01,True
1004,James,Wilson,19,Physics,2.8,2023-09-01,False
1005,Jessica,Martinez,22,Psychology,3.2,2020-09-01,True
1006,David,Anderson,20,Computer Science,3.6,2022-01-15,True
1007,Laura,Thomas,19,Biology,3.1,2023-09-01,True
1008,Robert,Jackson,21,Business Admin,2.5,2021-09-01,False
1009,John,White,23,Economics,3.4,2020-09-01,True
1010,Karen,Harris,20,Computer Science,3.7,2022-09-01,True

Writing student.csv

In [5]:
!type student.csv

StudentID,FirstName,LastName,Age,Major,GPA,EnrollmentDate,IsActive
1001,Emily,Johnson,19,Computer Science,3.8,2023-09-01,True
1002,Michael,Brown,20,Electrical Engineering,3.5,2022-09-01,True
1003,Sarah,Davis,21,Mathematics,3.9,2021-09-01,True
1004,James,Wilson,19,Physics,2.8,2023-09-01,False
1005,Jessica,Martinez,22,Psychology,3.2,2020-09-01,True
1006,David,Anderson,20,Computer Science,3.6,2022-01-15,True
1007,Laura,Thomas,19,Biology,3.1,2023-09-01,True
1008,Robert,Jackson,21,Business Admin,2.5,2021-09-01,False
1009,John,White,23,Economics,3.4,2020-09-01,True
1010,Karen,Harris,20,Computer Science,3.7,2022-09-01,True

In [6]:
data = pd.read_csv('student.csv')

In [9]:
data

,StudentID,FirstName,LastName,Age,Major,GPA,EnrollmentDate,IsActive
0,1001,Emily,Johnson,19,Computer Science,3.8,2023-09-01,True
1,1002,Michael,Brown,20,Electrical Engineering,3.5,2022-09-01,True
2,1003,Sarah,Davis,21,Mathematics,3.9,2021-09-01,True
3,1004,James,Wilson,19,Physics,2.8,2023-09-01,False
4,1005,Jessica,Martinez,22,Psychology,3.2,2020-09-01,True
5,1006,David,Anderson,20,Computer Science,3.6,2022-01-15,True
6,1007,Laura,Thomas,19,Biology,3.1,2023-09-01,True
7,1008,Robert,Jackson,21,Business Admin,2.5,2021-09-01,False
8,1009,John,White,23,Economics,3.4,2020-09-01,True
9,1010,Karen,Harris,20,Computer Science,3.7,2022-09-01,True

In [10]:
data.head()

,StudentID,FirstName,LastName,Age,Major,GPA,EnrollmentDate,IsActive
0,1001,Emily,Johnson,19,Computer Science,3.8,2023-09-01,True
1,1002,Michael,Brown,20,Electrical Engineering,3.5,2022-09-01,True
2,1003,Sarah,Davis,21,Mathematics,3.9,2021-09-01,True
3,1004,James,Wilson,19,Physics,2.8,2023-09-01,False
4,1005,Jessica,Martinez,22,Psychology,3.2,2020-09-01,True

In [11]:
data.tail(3)

,StudentID,FirstName,LastName,Age,Major,GPA,EnrollmentDate,IsActive
7,1008,Robert,Jackson,21,Business Admin,2.5,2021-09-01,False
8,1009,John,White,23,Economics,3.4,2020-09-01,True
9,1010,Karen,Harris,20,Computer Science,3.7,2022-09-01,True

In [12]:
data.shape

(10, 8)

## 3. Show summary statistics (describe()) for numeric columns.

In [15]:
data.describe()

        StudentID        Age        GPA
count    10.00000  10.000000  10.000000
mean   1005.50000  20.400000   3.350000
std       3.02765   1.349897   0.450309
min    1001.00000  19.000000   2.500000
25%    1003.25000  19.250000   3.125000
50%    1005.50000  20.000000   3.450000
75%    1007.75000  21.000000   3.675000
max    1010.00000  23.000000   3.900000

## 4. Convert a column "age" from string to integer type.

In [61]:
df = pd.DataFrame({
    'Name':['Alice','Bob','Charlie','John'],
    'Age':['23','25','23','27']
})

In [62]:
df

      Name Age
0    Alice  23
1      Bob  25
2  Charlie  23
3     John  27

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      object
dtypes: object(2)
memory usage: 196.0+ bytes

In [64]:
df['Age'] = df['Age'].astype(int)

In [65]:
df.dtypes

Name    object
Age      int64
dtype: object

## 5. Filter rows where: 
- age > 25
- city == "Dhaka"

In [66]:
df['City'] = ['Dhaka','Chittagoang','Sylhet','Dhaka']

In [67]:
df

      Name  Age         City
0    Alice   23        Dhaka
1      Bob   25  Chittagoang
2  Charlie   23       Sylhet
3     John   27        Dhaka

In [68]:
df.dtypes

Name    object
Age      int64
City    object
dtype: object

In [69]:
df[(df['Age'] > 25) & (df['City'] == 'Dhaka')]

   Name  Age   City
3  John   27  Dhaka

## 6. Sort the DataFrame by age (ascending & descending).

In [70]:
df.sort_values(by = 'Age', ascending = False )

      Name  Age         City
3     John   27        Dhaka
1      Bob   25  Chittagoang
0    Alice   23        Dhaka
2  Charlie   23       Sylhet

In [71]:
df.sort_values(by = 'Age')

      Name  Age         City
0    Alice   23        Dhaka
2  Charlie   23       Sylhet
1      Bob   25  Chittagoang
3     John   27        Dhaka

## 7. Drop a column "city" and create a new column "age_group":
- "young" if age < 25
- "adult" otherwise

In [72]:
df = df.drop(columns = ['City'])

In [76]:
df

      Name  Age
0    Alice   23
1      Bob   25
2  Charlie   23
3     John   27

In [78]:
df

      Name  Age
0    Alice   23
1      Bob   25
2  Charlie   23
3     John   27

In [80]:
def get_age_group(age):
    if age < 20:
        return 'Teenager'
    elif age < 22:
        return 'Young Adult'
    else:
        return 'Adult'

In [81]:
df['Age_Group'] = df['Age'].apply(get_age_group)

In [82]:
df

      Name  Age Age_Group
0    Alice   23     Adult
1      Bob   25     Adult
2  Charlie   23     Adult
3     John   27     Adult

## 8. Replace all missing values (NaN) in "salary" with the mean salary.

In [83]:
%%writefile employees.csv
EmployeeID,FirstName,LastName,Department,Salary,JoiningDate,Email
1001,John,Smith,Sales,62000,2022-01-15,john.smith@company.com
1002,Jane,Doe,Marketing,75000,2021-06-23,jane.doe@company.com
1003,Michael,Brown,IT,80000,2019-11-04,michael.brown@company.com
1004,Emily,Davis,HR,,2023-03-12,emily.davis@company.com
1005,Chris,Wilson,it,72000,2020-08-19,chris.wilson@company.com
1006,Anna,Taylor,Sales,"$55,000",2022-05-30,anna.taylor@company.com
1007,David,Anderson,Engineering,95000,2018-02-14,
1008,Laura,Thomas,Marketing,78000,Unknown,laura.thomas@company.com
1009,Robert,Jackson,IT,82000,2021-12-01,robert.jackson@company.com
1010,Kevin,White,Hr,60000,2023-01-10,kevin.white@company.com
1011,Sarah,Harris,Sales,64000,2022-09-05,sarah.harris@company.com
1012,James,Martin,finance,70000,2020-04-22,james.martin@company.com
1013,Jessica,Thompson,Engineering,"$105,000",2017-03-15,jessica.thompson@company.com
1014,Daniel,Garcia,IT,79000,2021-07-08,daniel.garcia@company.com
1015,Lisa,Martinez,Marketing,,2022-11-30,lisa.martinez@company.com
1016,Paul,Robinson,Finance,71000,2019-09-12,paul.robinson@company.com
1017,Karen,Clark,HR,58000,2023-05-20,karen.clark@company.com
1018,Mark,Rodriguez,Engineering,96000,2018-08-25,mark.rodriguez@company.com
1019,Steven,Lewis,Sales,63000,2022-02-18,steven.lewis@company.com
1001,John,Smith,Sales,62000,2022-01-15,john.smith@company.com

Writing employees.csv

In [84]:
!type employees.csv

EmployeeID,FirstName,LastName,Department,Salary,JoiningDate,Email
1001,John,Smith,Sales,62000,2022-01-15,john.smith@company.com
1002,Jane,Doe,Marketing,75000,2021-06-23,jane.doe@company.com
1003,Michael,Brown,IT,80000,2019-11-04,michael.brown@company.com
1004,Emily,Davis,HR,,2023-03-12,emily.davis@company.com
1005,Chris,Wilson,it,72000,2020-08-19,chris.wilson@company.com
1006,Anna,Taylor,Sales,"$55,000",2022-05-30,anna.taylor@company.com
1007,David,Anderson,Engineering,95000,2018-02-14,
1008,Laura,Thomas,Marketing,78000,Unknown,laura.thomas@company.com
1009,Robert,Jackson,IT,82000,2021-12-01,robert.jackson@company.com
1010,Kevin,White,Hr,60000,2023-01-10,kevin.white@company.com
1011,Sarah,Harris,Sales,64000,2022-09-05,sarah.harris@company.com
1012,James,Martin,finance,70000,2020-04-22,james.martin@company.com
1013,Jessica,Thompson,Engineering,"$105,000",2017-03-15,jessica.thompson@company.com
1014,Daniel,Garcia,IT,79000,2021-07-08,daniel.garcia@company.com
1015,Lisa,Martinez,Marketing,,2022-11-30,lisa.martinez@company.com
1016,Paul,Robinson,Finance,71000,2019-09-12,paul.robinson@company.com
1017,Karen,Clark,HR,58000,2023-05-20,karen.clark@company.com
1018,Mark,Rodriguez,Engineering,96000,2018-08-25,mark.rodriguez@company.com
1019,Steven,Lewis,Sales,63000,2022-02-18,steven.lewis@company.com
1001,John,Smith,Sales,62000,2022-01-15,john.smith@company.com

In [203]:
data = pd.read_csv('employees.csv')

In [204]:
data

,EmployeeID,FirstName,LastName,Department,Salary,JoiningDate,Email
0,1001,John,Smith,Sales,62000,2022-01-15,john.smith@company.com
1,1002,Jane,Doe,Marketing,75000,2021-06-23,jane.doe@company.com
2,1003,Michael,Brown,IT,80000,2019-11-04,michael.brown@company.com
3,1004,Emily,Davis,HR,NaN,2023-03-12,emily.davis@company.com
4,1005,Chris,Wilson,it,72000,2020-08-19,chris.wilson@company.com
5,1006,Anna,Taylor,Sales,"$55,000",2022-05-30,anna.taylor@company.com
6,1007,David,Anderson,Engineering,95000,2018-02-14,NaN
7,1008,Laura,Thomas,Marketing,78000,Unknown,laura.thomas@company.com
8,1009,Robert,Jackson,IT,82000,2021-12-01,robert.jackson@company.com
9,1010,Kevin,White,Hr,60000,2023-01-10,kevin.white@company.com
10,1011,Sarah,Harris,Sales,64000,2022-09-05,sarah.harris@company.com
11,1012,James,Martin,finance,70000,2020-04-22,james.martin@company.com
12,1013,Jessica,Thompson,Engineering,"$105,000",2017-03-15,jessica.thompson@company.com
13,1014,Daniel,Garcia,IT,79000,2021-07-08,daniel.garcia@company.com
14,1015,Lisa,Martinez,Marketing,NaN,2022-11-30,lisa.martinez@company.com
15,1016,Paul,Robinson,Finance,71000,2019-09-12,paul.robinson@company.com
16,1017,Karen,Clark,HR,58000,2023-05-20,karen.clark@company.com
17,1018,Mark,Rodriguez,Engineering,96000,2018-08-25,mark.rodriguez@company.com
18,1019,Steven,Lewis,Sales,63000,2022-02-18,steven.lewis@company.com
19,1001,John,Smith,Sales,62000,2022-01-15,john.smith@company.com

In [205]:
data.shape

(20, 7)

In [206]:
data.describe()

        EmployeeID
count    20.000000
mean   1009.550000
std       5.835238
min    1001.000000
25%    1004.750000
50%    1009.500000
75%    1014.250000
max    1019.000000

In [207]:
data.isnull().sum()

EmployeeID     0
FirstName      0
LastName       0
Department     0
Salary         2
JoiningDate    0
Email          1
dtype: int64

In [208]:
data['Salary'] = data['Salary'].str.replace(r'\D','', regex = True)

In [209]:
data

,EmployeeID,FirstName,LastName,Department,Salary,JoiningDate,Email
0,1001,John,Smith,Sales,62000,2022-01-15,john.smith@company.com
1,1002,Jane,Doe,Marketing,75000,2021-06-23,jane.doe@company.com
2,1003,Michael,Brown,IT,80000,2019-11-04,michael.brown@company.com
3,1004,Emily,Davis,HR,NaN,2023-03-12,emily.davis@company.com
4,1005,Chris,Wilson,it,72000,2020-08-19,chris.wilson@company.com
5,1006,Anna,Taylor,Sales,55000,2022-05-30,anna.taylor@company.com
6,1007,David,Anderson,Engineering,95000,2018-02-14,NaN
7,1008,Laura,Thomas,Marketing,78000,Unknown,laura.thomas@company.com
8,1009,Robert,Jackson,IT,82000,2021-12-01,robert.jackson@company.com
9,1010,Kevin,White,Hr,60000,2023-01-10,kevin.white@company.com
10,1011,Sarah,Harris,Sales,64000,2022-09-05,sarah.harris@company.com
11,1012,James,Martin,finance,70000,2020-04-22,james.martin@company.com
12,1013,Jessica,Thompson,Engineering,105000,2017-03-15,jessica.thompson@company.com
13,1014,Daniel,Garcia,IT,79000,2021-07-08,daniel.garcia@company.com
14,1015,Lisa,Martinez,Marketing,NaN,2022-11-30,lisa.martinez@company.com
15,1016,Paul,Robinson,Finance,71000,2019-09-12,paul.robinson@company.com
16,1017,Karen,Clark,HR,58000,2023-05-20,karen.clark@company.com
17,1018,Mark,Rodriguez,Engineering,96000,2018-08-25,mark.rodriguez@company.com
18,1019,Steven,Lewis,Sales,63000,2022-02-18,steven.lewis@company.com
19,1001,John,Smith,Sales,62000,2022-01-15,john.smith@company.com

In [210]:
data['Salary'] = pd.to_numeric(data['Salary'],errors = 'coerce')

In [211]:
data['Salary'].isnull().sum()

np.int64(2)

In [212]:
data['Salary'] = data['Salary'].fillna(data['Salary'].mean())

In [213]:
data

,EmployeeID,FirstName,LastName,Department,Salary,JoiningDate,Email
0,1001,John,Smith,Sales,62000.000000,2022-01-15,john.smith@company.com
1,1002,Jane,Doe,Marketing,75000.000000,2021-06-23,jane.doe@company.com
2,1003,Michael,Brown,IT,80000.000000,2019-11-04,michael.brown@company.com
3,1004,Emily,Davis,HR,73722.222222,2023-03-12,emily.davis@company.com
4,1005,Chris,Wilson,it,72000.000000,2020-08-19,chris.wilson@company.com
5,1006,Anna,Taylor,Sales,55000.000000,2022-05-30,anna.taylor@company.com
6,1007,David,Anderson,Engineering,95000.000000,2018-02-14,NaN
7,1008,Laura,Thomas,Marketing,78000.000000,Unknown,laura.thomas@company.com
8,1009,Robert,Jackson,IT,82000.000000,2021-12-01,robert.jackson@company.com
9,1010,Kevin,White,Hr,60000.000000,2023-01-10,kevin.white@company.com
10,1011,Sarah,Harris,Sales,64000.000000,2022-09-05,sarah.harris@company.com
11,1012,James,Martin,finance,70000.000000,2020-04-22,james.martin@company.com
12,1013,Jessica,Thompson,Engineering,105000.000000,2017-03-15,jessica.thompson@company.com
13,1014,Daniel,Garcia,IT,79000.000000,2021-07-08,daniel.garcia@company.com
14,1015,Lisa,Martinez,Marketing,73722.222222,2022-11-30,lisa.martinez@company.com
15,1016,Paul,Robinson,Finance,71000.000000,2019-09-12,paul.robinson@company.com
16,1017,Karen,Clark,HR,58000.000000,2023-05-20,karen.clark@company.com
17,1018,Mark,Rodriguez,Engineering,96000.000000,2018-08-25,mark.rodriguez@company.com
18,1019,Steven,Lewis,Sales,63000.000000,2022-02-18,steven.lewis@company.com
19,1001,John,Smith,Sales,62000.000000,2022-01-15,john.smith@company.com

In [214]:
data.isnull().sum()

EmployeeID     0
FirstName      0
LastName       0
Department     0
Salary         0
JoiningDate    0
Email          1
dtype: int64

## 9. Read a CSV and rename columns to lowercase.

In [215]:
upper = pd.read_csv('employees.csv')

In [216]:
upper

,EmployeeID,FirstName,LastName,Department,Salary,JoiningDate,Email
0,1001,John,Smith,Sales,62000,2022-01-15,john.smith@company.com
1,1002,Jane,Doe,Marketing,75000,2021-06-23,jane.doe@company.com
2,1003,Michael,Brown,IT,80000,2019-11-04,michael.brown@company.com
3,1004,Emily,Davis,HR,NaN,2023-03-12,emily.davis@company.com
4,1005,Chris,Wilson,it,72000,2020-08-19,chris.wilson@company.com
5,1006,Anna,Taylor,Sales,"$55,000",2022-05-30,anna.taylor@company.com
6,1007,David,Anderson,Engineering,95000,2018-02-14,NaN
7,1008,Laura,Thomas,Marketing,78000,Unknown,laura.thomas@company.com
8,1009,Robert,Jackson,IT,82000,2021-12-01,robert.jackson@company.com
9,1010,Kevin,White,Hr,60000,2023-01-10,kevin.white@company.com
10,1011,Sarah,Harris,Sales,64000,2022-09-05,sarah.harris@company.com
11,1012,James,Martin,finance,70000,2020-04-22,james.martin@company.com
12,1013,Jessica,Thompson,Engineering,"$105,000",2017-03-15,jessica.thompson@company.com
13,1014,Daniel,Garcia,IT,79000,2021-07-08,daniel.garcia@company.com
14,1015,Lisa,Martinez,Marketing,NaN,2022-11-30,lisa.martinez@company.com
15,1016,Paul,Robinson,Finance,71000,2019-09-12,paul.robinson@company.com
16,1017,Karen,Clark,HR,58000,2023-05-20,karen.clark@company.com
17,1018,Mark,Rodriguez,Engineering,96000,2018-08-25,mark.rodriguez@company.com
18,1019,Steven,Lewis,Sales,63000,2022-02-18,steven.lewis@company.com
19,1001,John,Smith,Sales,62000,2022-01-15,john.smith@company.com

In [217]:
upper.columns = upper.columns.str.lower()

In [218]:
upper

,employeeid,firstname,lastname,department,salary,joiningdate,email
0,1001,John,Smith,Sales,62000,2022-01-15,john.smith@company.com
1,1002,Jane,Doe,Marketing,75000,2021-06-23,jane.doe@company.com
2,1003,Michael,Brown,IT,80000,2019-11-04,michael.brown@company.com
3,1004,Emily,Davis,HR,NaN,2023-03-12,emily.davis@company.com
4,1005,Chris,Wilson,it,72000,2020-08-19,chris.wilson@company.com
5,1006,Anna,Taylor,Sales,"$55,000",2022-05-30,anna.taylor@company.com
6,1007,David,Anderson,Engineering,95000,2018-02-14,NaN
7,1008,Laura,Thomas,Marketing,78000,Unknown,laura.thomas@company.com
8,1009,Robert,Jackson,IT,82000,2021-12-01,robert.jackson@company.com
9,1010,Kevin,White,Hr,60000,2023-01-10,kevin.white@company.com
10,1011,Sarah,Harris,Sales,64000,2022-09-05,sarah.harris@company.com
11,1012,James,Martin,finance,70000,2020-04-22,james.martin@company.com
12,1013,Jessica,Thompson,Engineering,"$105,000",2017-03-15,jessica.thompson@company.com
13,1014,Daniel,Garcia,IT,79000,2021-07-08,daniel.garcia@company.com
14,1015,Lisa,Martinez,Marketing,NaN,2022-11-30,lisa.martinez@company.com
15,1016,Paul,Robinson,Finance,71000,2019-09-12,paul.robinson@company.com
16,1017,Karen,Clark,HR,58000,2023-05-20,karen.clark@company.com
17,1018,Mark,Rodriguez,Engineering,96000,2018-08-25,mark.rodriguez@company.com
18,1019,Steven,Lewis,Sales,63000,2022-02-18,steven.lewis@company.com
19,1001,John,Smith,Sales,62000,2022-01-15,john.smith@company.com

## 10. Group data by "department" and calculate:
- mean salary
- total salary
- employee count

In [219]:
data

,EmployeeID,FirstName,LastName,Department,Salary,JoiningDate,Email
0,1001,John,Smith,Sales,62000.000000,2022-01-15,john.smith@company.com
1,1002,Jane,Doe,Marketing,75000.000000,2021-06-23,jane.doe@company.com
2,1003,Michael,Brown,IT,80000.000000,2019-11-04,michael.brown@company.com
3,1004,Emily,Davis,HR,73722.222222,2023-03-12,emily.davis@company.com
4,1005,Chris,Wilson,it,72000.000000,2020-08-19,chris.wilson@company.com
5,1006,Anna,Taylor,Sales,55000.000000,2022-05-30,anna.taylor@company.com
6,1007,David,Anderson,Engineering,95000.000000,2018-02-14,NaN
7,1008,Laura,Thomas,Marketing,78000.000000,Unknown,laura.thomas@company.com
8,1009,Robert,Jackson,IT,82000.000000,2021-12-01,robert.jackson@company.com
9,1010,Kevin,White,Hr,60000.000000,2023-01-10,kevin.white@company.com
10,1011,Sarah,Harris,Sales,64000.000000,2022-09-05,sarah.harris@company.com
11,1012,James,Martin,finance,70000.000000,2020-04-22,james.martin@company.com
12,1013,Jessica,Thompson,Engineering,105000.000000,2017-03-15,jessica.thompson@company.com
13,1014,Daniel,Garcia,IT,79000.000000,2021-07-08,daniel.garcia@company.com
14,1015,Lisa,Martinez,Marketing,73722.222222,2022-11-30,lisa.martinez@company.com
15,1016,Paul,Robinson,Finance,71000.000000,2019-09-12,paul.robinson@company.com
16,1017,Karen,Clark,HR,58000.000000,2023-05-20,karen.clark@company.com
17,1018,Mark,Rodriguez,Engineering,96000.000000,2018-08-25,mark.rodriguez@company.com
18,1019,Steven,Lewis,Sales,63000.000000,2022-02-18,steven.lewis@company.com
19,1001,John,Smith,Sales,62000.000000,2022-01-15,john.smith@company.com

In [221]:
data.groupby('Department').agg({
    'Salary':['mean','sum'],
    'EmployeeID':'count'
})

                   Salary                EmployeeID
                     mean            sum      count
Department
Engineering  98666.666667  296000.000000          3
Finance      71000.000000   71000.000000          1
HR           65861.111111  131722.222222          2
Hr           60000.000000   60000.000000          1
IT           80333.333333  241000.000000          3
Marketing    75574.074074  226722.222222          3
Sales        61200.000000  306000.000000          5
finance      70000.000000   70000.000000          1
it           72000.000000   72000.000000          1

In [222]:
data['Department_Avg_Salary'] = data.groupby('Department')['Salary'].transform('mean')

In [223]:
data['Department_Total_Salary'] = data.groupby('Department')['Salary'].transform('sum')

In [224]:
data['Department_Employee'] = data.groupby('Department')['EmployeeID'].transform('count')

In [225]:
data

,EmployeeID,FirstName,LastName,Department,Salary,JoiningDate,Email,Department_Avg_Salary,Department_Total_Salary,Department_Employee
0,1001,John,Smith,Sales,62000.000000,2022-01-15,john.smith@company.com,61200.000000,306000.000000,5
1,1002,Jane,Doe,Marketing,75000.000000,2021-06-23,jane.doe@company.com,75574.074074,226722.222222,3
2,1003,Michael,Brown,IT,80000.000000,2019-11-04,michael.brown@company.com,80333.333333,241000.000000,3
3,1004,Emily,Davis,HR,73722.222222,2023-03-12,emily.davis@company.com,65861.111111,131722.222222,2
4,1005,Chris,Wilson,it,72000.000000,2020-08-19,chris.wilson@company.com,72000.000000,72000.000000,1
5,1006,Anna,Taylor,Sales,55000.000000,2022-05-30,anna.taylor@company.com,61200.000000,306000.000000,5
6,1007,David,Anderson,Engineering,95000.000000,2018-02-14,NaN,98666.666667,296000.000000,3
7,1008,Laura,Thomas,Marketing,78000.000000,Unknown,laura.thomas@company.com,75574.074074,226722.222222,3
8,1009,Robert,Jackson,IT,82000.000000,2021-12-01,robert.jackson@company.com,80333.333333,241000.000000,3
9,1010,Kevin,White,Hr,60000.000000,2023-01-10,kevin.white@company.com,60000.000000,60000.000000,1
10,1011,Sarah,Harris,Sales,64000.000000,2022-09-05,sarah.harris@company.com,61200.000000,306000.000000,5
11,1012,James,Martin,finance,70000.000000,2020-04-22,james.martin@company.com,70000.000000,70000.000000,1
12,1013,Jessica,Thompson,Engineering,105000.000000,2017-03-15,jessica.thompson@company.com,98666.666667,296000.000000,3
13,1014,Daniel,Garcia,IT,79000.000000,2021-07-08,daniel.garcia@company.com,80333.333333,241000.000000,3
14,1015,Lisa,Martinez,Marketing,73722.222222,2022-11-30,lisa.martinez@company.com,75574.074074,226722.222222,3
15,1016,Paul,Robinson,Finance,71000.000000,2019-09-12,paul.robinson@company.com,71000.000000,71000.000000,1
16,1017,Karen,Clark,HR,58000.000000,2023-05-20,karen.clark@company.com,65861.111111,131722.222222,2
17,1018,Mark,Rodriguez,Engineering,96000.000000,2018-08-25,mark.rodriguez@company.com,98666.666667,296000.000000,3
18,1019,Steven,Lewis,Sales,63000.000000,2022-02-18,steven.lewis@company.com,61200.000000,306000.000000,5
19,1001,John,Smith,Sales,62000.000000,2022-01-15,john.smith@company.com,61200.000000,306000.000000,5

## 11. Filter rows using multiple conditions:
- salary > 50,000
- age between 25 and 35

In [226]:
df

      Name  Age Age_Group
0    Alice   23     Adult
1      Bob   25     Adult
2  Charlie   23     Adult
3     John   27     Adult

In [227]:
df['Salary'] = [60000,70000,40000,50000]

In [228]:
df

      Name  Age Age_Group  Salary
0    Alice   23     Adult   60000
1      Bob   25     Adult   70000
2  Charlie   23     Adult   40000
3     John   27     Adult   50000

In [237]:
# df[(df['Salary'] > 50000) & ((df['Age'] >= 25) & (df['Age'] <= 30))]
df[(df['Salary'] > 50000) & (df['Age'].between(25,30))]

  Name  Age Age_Group  Salary
1  Bob   25     Adult   70000

## 12. Add a column "monthly_salary" = salary/12

In [238]:
df['Monthly_Salary'] = df['Salary']/12

In [239]:
df

      Name  Age Age_Group  Salary  Monthly_Salary
0    Alice   23     Adult   60000     5000.000000
1      Bob   25     Adult   70000     5833.333333
2  Charlie   23     Adult   40000     3333.333333
3     John   27     Adult   50000     4166.666667

## 13. Remove duplicate entries based on "email"

In [240]:
data

,EmployeeID,FirstName,LastName,Department,Salary,JoiningDate,Email,Department_Avg_Salary,Department_Total_Salary,Department_Employee
0,1001,John,Smith,Sales,62000.000000,2022-01-15,john.smith@company.com,61200.000000,306000.000000,5
1,1002,Jane,Doe,Marketing,75000.000000,2021-06-23,jane.doe@company.com,75574.074074,226722.222222,3
2,1003,Michael,Brown,IT,80000.000000,2019-11-04,michael.brown@company.com,80333.333333,241000.000000,3
3,1004,Emily,Davis,HR,73722.222222,2023-03-12,emily.davis@company.com,65861.111111,131722.222222,2
4,1005,Chris,Wilson,it,72000.000000,2020-08-19,chris.wilson@company.com,72000.000000,72000.000000,1
5,1006,Anna,Taylor,Sales,55000.000000,2022-05-30,anna.taylor@company.com,61200.000000,306000.000000,5
6,1007,David,Anderson,Engineering,95000.000000,2018-02-14,NaN,98666.666667,296000.000000,3
7,1008,Laura,Thomas,Marketing,78000.000000,Unknown,laura.thomas@company.com,75574.074074,226722.222222,3
8,1009,Robert,Jackson,IT,82000.000000,2021-12-01,robert.jackson@company.com,80333.333333,241000.000000,3
9,1010,Kevin,White,Hr,60000.000000,2023-01-10,kevin.white@company.com,60000.000000,60000.000000,1
10,1011,Sarah,Harris,Sales,64000.000000,2022-09-05,sarah.harris@company.com,61200.000000,306000.000000,5
11,1012,James,Martin,finance,70000.000000,2020-04-22,james.martin@company.com,70000.000000,70000.000000,1
12,1013,Jessica,Thompson,Engineering,105000.000000,2017-03-15,jessica.thompson@company.com,98666.666667,296000.000000,3
13,1014,Daniel,Garcia,IT,79000.000000,2021-07-08,daniel.garcia@company.com,80333.333333,241000.000000,3
14,1015,Lisa,Martinez,Marketing,73722.222222,2022-11-30,lisa.martinez@company.com,75574.074074,226722.222222,3
15,1016,Paul,Robinson,Finance,71000.000000,2019-09-12,paul.robinson@company.com,71000.000000,71000.000000,1
16,1017,Karen,Clark,HR,58000.000000,2023-05-20,karen.clark@company.com,65861.111111,131722.222222,2
17,1018,Mark,Rodriguez,Engineering,96000.000000,2018-08-25,mark.rodriguez@company.com,98666.666667,296000.000000,3
18,1019,Steven,Lewis,Sales,63000.000000,2022-02-18,steven.lewis@company.com,61200.000000,306000.000000,5
19,1001,John,Smith,Sales,62000.000000,2022-01-15,john.smith@company.com,61200.000000,306000.000000,5

In [243]:
data[data['Email'].duplicated()]

,EmployeeID,FirstName,LastName,Department,Salary,JoiningDate,Email,Department_Avg_Salary,Department_Total_Salary,Department_Employee
19,1001,John,Smith,Sales,62000.0,2022-01-15,john.smith@company.com,61200.0,306000.0,5

## 14. Convert "joining_date" to datetime and extract:
- year
- month
- day

## 15. Use .apply() to clean a "name" column (capitalize all names properly)

## 16. Merge two DataFrames:
- employees.csv
- departments.csv
- Using "dept_id".

## 17. Pivot a table:
- index: department
- columns: gender
- values: salary (mean)

## 18. Create a new column "performance_score" using a function:
- score = (projects_completed * 0.6) + (attendance * 0.4)

## 19. Remove outliers from the "salary" column using:
- IQR method

## 20. Resample time-series data (daily  monthly) and compute monthly averages